{
  "id": "act-74-1989",
  "type": "statute",
  "title": "Vyhláška Federálneho ministerstva financií, Ministerstva financií a miezd Českej socialistickej republiky, Ministerstva financií, cien a miezd Slovenskej socialistickej republiky a predsedu Štátnej banky československej, ktorou sa mení a dopĺňa vyhláška Federálneho ministerstva financií, Ministerstva financií Českej socialistickej republiky, Ministerstva financií Slovenskej socialistickej republiky a predsedu Štátnej banky československej č. 136/1985 Zb. o finančnej, úverovej a inej pomoci družstevnej a individuálnej bytovej výstavbe a modernizácii rodinných domčekov v osobnom vlastníctve",
  "title_en": "Vyhláška Federálneho ministerstva financií, Ministerstva financií a miezd Českej socialistickej republiky, Ministerstva financií, cien a miezd Slovenskej socialistickej republiky a predsedu Štátnej banky československej, ktorou sa mení a dopĺňa vyhláška Federálneho ministerstva financií, Ministerstva financií Českej socialistickej republiky, Ministerstva financií Slovenskej socialistickej republiky a predsedu Štátnej banky československej č. 136/1985 Zb. o finančnej, úverovej a inej pomoci družstevnej a individuálnej bytovej výstavbe a modernizácii rodinných domčekov v osobnom vlastníctve",
  "short_name": "74/1989 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/1989/74/",
  "description": "Official legal act listed in Slov-Lex: Vyhláška Federálneho ministerstva financií, Ministerstva financií a miezd Českej socialistickej republiky, Ministerstva financií, cien a miezd Slovenskej socialistickej republiky a predsedu Štátnej banky československej, ktorou sa mení a dopĺňa vyhláška Federálneho ministerstva financií, Ministerstva financií Českej socialistickej republiky, Ministerstva financií Slovenskej socialistickej republiky a predsedu Štátnej banky československej č. 136/1985 Zb. o finančnej, úverovej a inej pomoci družstevnej a individuálnej bytovej výstavbe a modernizácii rodinných domčekov v osobnom vlastníctve",
  "provisions": [],
  "definitions": []
}