{
  "id": "act-9-2024",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Policajného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Horskej záchrannej služby, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Zboru väzenskej a justičnej stráže, o dodatku č. 18 ku kolektívnej zmluve vyššieho stupňa medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Asociáciou štátnych nemocníc Slovenskej republiky a o dodatku č. 10 ku kolektívnej zmluve vyššieho stupňa medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Policajného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Horskej záchrannej služby, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Zboru väzenskej a justičnej stráže, o dodatku č. 18 ku kolektívnej zmluve vyššieho stupňa medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Asociáciou štátnych nemocníc Slovenskej republiky a o dodatku č. 10 ku kolektívnej zmluve vyššieho stupňa medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb",
  "short_name": "9/2024 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2024/9/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Policajného zboru, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Horskej záchrannej služby, o uložení kolektívnej zmluvy vyššieho stupňa pre príslušníkov Zboru väzenskej a justičnej stráže, o dodatku č. 18 ku kolektívnej zmluve vyššieho stupňa medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Asociáciou štátnych nemocníc Slovenskej republiky a o dodatku č. 10 ku kolektívnej zmluve vyššieho stupňa medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb",
  "provisions": [],
  "definitions": []
}