{
  "id": "act-138-1994",
  "type": "statute",
  "title": "Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o uzavretí Zmluvy medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky o finančnom vyrovnaní záväzku vzniknutého z realizácie solidárnej záruky podľa Dohody medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky na jednej strane a Československou obchodnou bankou, a. s., na strane druhej o prevzatí záväzkov a pohľadávok vo voľne zameniteľných menách zahrnutých do centrálneho devízového zdroja do štátnych finančných aktív a pasív z 30. decembra 1992",
  "title_en": "Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o uzavretí Zmluvy medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky o finančnom vyrovnaní záväzku vzniknutého z realizácie solidárnej záruky podľa Dohody medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky na jednej strane a Československou obchodnou bankou, a. s., na strane druhej o prevzatí záväzkov a pohľadávok vo voľne zameniteľných menách zahrnutých do centrálneho devízového zdroja do štátnych finančných aktív a pasív z 30. decembra 1992",
  "short_name": "138/1994 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/1994/138/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o uzavretí Zmluvy medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky o finančnom vyrovnaní záväzku vzniknutého z realizácie solidárnej záruky podľa Dohody medzi Ministerstvom financií Slovenskej republiky a Ministerstvom financií Českej republiky na jednej strane a Československou obchodnou bankou, a. s., na strane druhej o prevzatí záväzkov a pohľadávok vo voľne zameniteľných menách zahrnutých do centrálneho devízového zdroja do štátnych finančných aktív a pasív z 30. decembra 1992",
  "provisions": [],
  "definitions": []
}