{
  "id": "act-30-2024",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky, pre odvetvie verejných vodovodov a verejných kanalizácií v Slovenskej republike, o uložení dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa pre odvetvie celulózo-papierenského priemyslu v Slovenskej republike, o uložení Dodatku č. 4 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, o uložení Dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa medzi Odborovým zväzom KOVO a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a Dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Asociáciou zamestnancov chemického a farmaceutického priemyslu SR a Zväzom chemického a farmaceutického priemyslu Slovenskej republiky",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky, pre odvetvie verejných vodovodov a verejných kanalizácií v Slovenskej republike, o uložení dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa pre odvetvie celulózo-papierenského priemyslu v Slovenskej republike, o uložení Dodatku č. 4 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, o uložení Dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa medzi Odborovým zväzom KOVO a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a Dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Asociáciou zamestnancov chemického a farmaceutického priemyslu SR a Zväzom chemického a farmaceutického priemyslu Slovenskej republiky",
  "short_name": "30/2024 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2024/30/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky, pre odvetvie verejných vodovodov a verejných kanalizácií v Slovenskej republike, o uložení dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa pre odvetvie celulózo-papierenského priemyslu v Slovenskej republike, o uložení Dodatku č. 4 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, o uložení Dodatku č. 1 ku Kolektívnej zmluve vyššieho stupňa medzi Odborovým zväzom KOVO a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a Dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa medzi Energeticko-chemickým odborovým zväzom a Asociáciou zamestnancov chemického a farmaceutického priemyslu SR a Zväzom chemického a farmaceutického priemyslu Slovenskej republiky",
  "provisions": [],
  "definitions": []
}