{
  "id": "act-69-2018",
  "type": "statute",
  "title": "Zákon č. 69/2018 Z.z. o kybernetickej bezpečnosti",
  "title_en": "Act No. 69/2018 Coll. on Cybersecurity",
  "short_name": "Cybersecurity Act",
  "status": "in_force",
  "issued_date": "2018-02-28",
  "in_force_date": "2018-04-01",
  "url": "https://www.slov-lex.sk/pravne-predpisy/SK/ZZ/2018/69/",
  "description": "Slovak cybersecurity legislation implementing Directive (EU) 2016/1148 (NIS Directive) and subsequently amended to align with Directive (EU) 2022/2555 (NIS2). Establishes the National Security Authority (NBÚ) as the central cybersecurity authority, defines essential and important service operators, and sets incident reporting obligations.",
  "provisions": [
    {
      "provision_ref": "§1",
      "chapter": "Part One – General Provisions",
      "section": "§1",
      "title": "Subject matter",
      "content": "This Act regulates cybersecurity, the rights and obligations of persons and the competence of state administration bodies in the field of cybersecurity. This Act transposes Directive (EU) 2016/1148 of the European Parliament and of the Council of 6 July 2016 concerning measures for a high common level of security of network and information systems across the Union (NIS Directive) and is aligned with Directive (EU) 2022/2555 (NIS2 Directive)."
    },
    {
      "provision_ref": "§2",
      "chapter": "Part One – General Provisions",
      "section": "§2",
      "title": "Definitions",
      "content": "For the purposes of this Act: (a) 'cybersecurity' means the set of measures and activities aimed at protecting networks, information systems, their users and other persons against cyber threats; (b) 'cyber threat' means any potential circumstance, event or action that could damage, disrupt or otherwise adversely affect networks and information systems; (c) 'incident' means any event having an actual adverse effect on the security of networks and information systems; (d) 'essential service operator' means a public or private entity providing a service essential for maintaining critical societal or economic activities; (e) 'digital service provider' means a legal person that provides a digital service within the meaning of the NIS Directive."
    },
    {
      "provision_ref": "§3",
      "chapter": "Part One – General Provisions",
      "section": "§3",
      "title": "Scope",
      "content": "This Act applies to: (a) operators of essential services identified pursuant to this Act; (b) digital service providers providing services in the territory of the Slovak Republic; (c) providers of basic service components; (d) state administration bodies in the area of cybersecurity. This Act does not apply to micro-enterprises and small enterprises as defined in Commission Recommendation 2003/361/EC, unless they operate essential services or provide digital services of critical importance."
    },
    {
      "provision_ref": "§4",
      "chapter": "Part Two – National Cybersecurity Governance",
      "section": "§4",
      "title": "National Security Authority as central authority",
      "content": "The National Security Authority (Národný bezpečnostný úrad, NBÚ) is the central state administration body for cybersecurity. The NBÚ shall: (a) prepare and update the national cybersecurity strategy; (b) maintain the national CSIRT (Computer Security Incident Response Team); (c) coordinate cybersecurity activities among state bodies; (d) represent the Slovak Republic in international cybersecurity cooperation."
    },
    {
      "provision_ref": "§5",
      "chapter": "Part Two – National Cybersecurity Governance",
      "section": "§5",
      "title": "National Cybersecurity Strategy",
      "content": "The Government of the Slovak Republic shall approve the national cybersecurity strategy on the proposal of the NBÚ. The strategy shall define the strategic objectives in the area of cybersecurity, identify the main cyber threats and risks, and establish priorities for the protection of the most critical information infrastructure. The strategy shall be updated at least every five years."
    },
    {
      "provision_ref": "§6",
      "chapter": "Part Two – National Cybersecurity Governance",
      "section": "§6",
      "title": "National CSIRT",
      "content": "The national CSIRT (SK-CERT) shall operate under the NBÚ and shall: (a) monitor cyber threats at the national level; (b) issue early warnings, alerts and announcements concerning risks and incidents; (c) respond to incidents and provide assistance to affected entities; (d) collect and analyze data on cyber incidents; (e) cooperate with CSIRTs of other EU Member States and with ENISA pursuant to Directive (EU) 2022/2555."
    },
    {
      "provision_ref": "§7",
      "chapter": "Part Two – National Cybersecurity Governance",
      "section": "§7",
      "title": "Sectoral CSIRTs",
      "content": "Sector-specific CSIRTs may be established by the respective sector regulators in coordination with the NBÚ. Sectoral CSIRTs shall be established for: (a) the energy sector; (b) the transport sector; (c) the banking and financial market infrastructure sector; (d) the health sector; (e) the digital infrastructure sector. Sectoral CSIRTs shall cooperate with the national CSIRT."
    },
    {
      "provision_ref": "§8",
      "chapter": "Part Three – Operators of Essential Services",
      "section": "§8",
      "title": "Identification of essential service operators",
      "content": "The NBÚ shall identify operators of essential services in the sectors listed in Annex I to this Act. An entity is an essential service operator if: (a) it provides a service which is essential for the maintenance of critical societal or economic activities; (b) the provision of that service depends on network and information systems; (c) an incident would have a significant disruptive effect on the provision of that service. The list of identified operators shall be reviewed at least every two years."
    },
    {
      "provision_ref": "§9",
      "chapter": "Part Three – Operators of Essential Services",
      "section": "§9",
      "title": "Security obligations of essential service operators",
      "content": "Operators of essential services shall take appropriate and proportionate technical and organizational measures to manage the risks posed to the security of networks and information systems which they use. These measures shall ensure a level of security appropriate to the risk, taking into account: (a) the state of the art; (b) applicable European and international standards; (c) the costs of implementation; (d) the specific risk to the operator. Operators shall have in place a cybersecurity management system and shall designate a responsible person for cybersecurity."
    },
    {
      "provision_ref": "§10",
      "chapter": "Part Three – Operators of Essential Services",
      "section": "§10",
      "title": "Incident reporting",
      "content": "Operators of essential services shall, without undue delay, notify the national CSIRT and the NBÚ of any incident having a significant impact on the continuity of the essential service they provide. The notification shall include: (a) a description of the incident, including its nature and impact; (b) the number of users affected; (c) the geographical spread; (d) the duration of the incident; (e) the measures taken or planned to address the incident. A preliminary notification shall be submitted within 24 hours of becoming aware of the incident, and a full report within 72 hours."
    },
    {
      "provision_ref": "§11",
      "chapter": "Part Three – Operators of Essential Services",
      "section": "§11",
      "title": "Cybersecurity audit",
      "content": "Operators of essential services shall undergo a regular cybersecurity audit at least once every two years. The audit shall be performed by an accredited auditor and shall assess the compliance of the operator's security measures with the requirements of this Act and related regulations. The audit report shall be submitted to the NBÚ within 30 days of completion."
    },
    {
      "provision_ref": "§12",
      "chapter": "Part Four – Digital Service Providers",
      "section": "§12",
      "title": "Security requirements for digital service providers",
      "content": "Digital service providers shall take appropriate and proportionate technical and organizational measures to manage the risks posed to the security of networks and information systems which they use for the provision of digital services. These measures shall take into account: (a) the security of systems and facilities; (b) incident handling; (c) business continuity management; (d) monitoring, auditing and testing; (e) compliance with international standards."
    },
    {
      "provision_ref": "§13",
      "chapter": "Part Four – Digital Service Providers",
      "section": "§13",
      "title": "Incident reporting by digital service providers",
      "content": "Digital service providers shall notify the national CSIRT and the NBÚ of any incident having a substantial impact on the provision of a digital service. The assessment of substantial impact shall take into account: (a) the number of users affected; (b) the duration of the incident; (c) the geographical spread; (d) the extent of disruption to the functioning of the digital service; (e) the extent of impact on economic and societal activities."
    },
    {
      "provision_ref": "§14",
      "chapter": "Part Five – Cybersecurity Measures",
      "section": "§14",
      "title": "Security categories and classification",
      "content": "Networks and information systems shall be classified into security categories based on the assessment of potential impact of a cybersecurity incident. The NBÚ shall establish by decree the criteria for classification, security requirements for each category, and the methodology for risk assessment. The classification shall be reviewed and updated as necessary, but at least once a year."
    },
    {
      "provision_ref": "§15",
      "chapter": "Part Five – Cybersecurity Measures",
      "section": "§15",
      "title": "Minimum security measures",
      "content": "All entities subject to this Act shall implement the following minimum security measures: (a) risk analysis and information security policies; (b) incident handling procedures; (c) business continuity measures including backup management and disaster recovery; (d) supply chain security; (e) security in acquisition, development and maintenance of networks and information systems; (f) policies and procedures for assessing the effectiveness of cybersecurity risk management measures; (g) basic cyber hygiene practices and cybersecurity training; (h) policies regarding the use of cryptography and encryption; (i) human resources security, access control policies, and asset management."
    },
    {
      "provision_ref": "§16",
      "chapter": "Part Five – Cybersecurity Measures",
      "section": "§16",
      "title": "Vulnerability handling and disclosure",
      "content": "The NBÚ shall establish and maintain a coordinated vulnerability disclosure framework. Operators of essential services and digital service providers shall: (a) adopt policies for handling vulnerabilities in network and information systems; (b) participate in the coordinated vulnerability disclosure process; (c) report identified vulnerabilities to the national CSIRT. The NBÚ shall maintain a national vulnerability database, which shall be interconnected with the EU vulnerability database established under Directive (EU) 2022/2555."
    },
    {
      "provision_ref": "§17",
      "chapter": "Part Five – Cybersecurity Measures",
      "section": "§17",
      "title": "Supply chain security",
      "content": "Operators of essential services and digital service providers shall address cybersecurity risks in their supply chains and supplier relationships. In assessing supply chain risks, entities shall take into account: (a) the cybersecurity practices of their direct suppliers and service providers; (b) the overall quality of products and cybersecurity practices of suppliers; (c) the results of coordinated security risk assessments of critical supply chains carried out at the Union level."
    },
    {
      "provision_ref": "§18",
      "chapter": "Part Six – Supervision and Enforcement",
      "section": "§18",
      "title": "Supervisory powers of the NBÚ",
      "content": "The NBÚ shall have the power to: (a) carry out inspections of operators of essential services and digital service providers; (b) require operators and providers to provide information necessary for assessing the security of their networks and information systems; (c) issue binding instructions to remedy identified deficiencies; (d) impose administrative fines for breaches of this Act."
    },
    {
      "provision_ref": "§19",
      "chapter": "Part Six – Supervision and Enforcement",
      "section": "§19",
      "title": "Administrative fines",
      "content": "The NBÚ may impose an administrative fine of up to EUR 300,000 on an operator of essential services or a digital service provider for a breach of the obligations laid down in this Act. For repeated or serious breaches, the fine may be up to EUR 1,000,000. When deciding on the fine amount, the NBÚ shall take into account the gravity and duration of the breach, the number of affected users, whether the breach was intentional or negligent, and any remedial steps taken by the entity."
    },
    {
      "provision_ref": "§20",
      "chapter": "Part Seven – International Cooperation",
      "section": "§20",
      "title": "EU cooperation",
      "content": "The NBÚ shall cooperate with the competent authorities of other EU Member States, ENISA, and the Cooperation Group established under Directive (EU) 2022/2555. The NBÚ shall participate in the CSIRTs network established under Article 15 of Directive (EU) 2022/2555 and contribute to the development of Union-level coordinated cybersecurity risk assessments."
    },
    {
      "provision_ref": "§21",
      "chapter": "Part Seven – International Cooperation",
      "section": "§21",
      "title": "Information sharing",
      "content": "The NBÚ may share information on cyber threats, vulnerabilities and incidents with the competent authorities of other states and with international organizations, provided that such sharing: (a) is necessary for ensuring cybersecurity; (b) does not compromise the confidentiality of information obtained in the course of supervisory activities; (c) is in compliance with the laws on classified information and personal data protection. The NBÚ shall participate in EU-level information sharing arrangements."
    }
  ],
  "definitions": [
    {
      "term": "kybernetická bezpečnosť",
      "definition": "The set of measures and activities aimed at protecting networks, information systems, their users and other persons against cyber threats.",
      "source_provision": "§2"
    },
    {
      "term": "kybernetická hrozba",
      "definition": "Any potential circumstance, event or action that could damage, disrupt or otherwise adversely affect networks and information systems.",
      "source_provision": "§2"
    },
    {
      "term": "incident",
      "definition": "Any event having an actual adverse effect on the security of networks and information systems.",
      "source_provision": "§2"
    },
    {
      "term": "prevádzkovateľ základnej služby",
      "definition": "A public or private entity identified pursuant to this Act that provides a service essential for maintaining critical societal or economic activities, the provision of which depends on network and information systems.",
      "source_provision": "§2"
    },
    {
      "term": "NBÚ",
      "definition": "Národný bezpečnostný úrad (National Security Authority), the central state administration body for cybersecurity in the Slovak Republic.",
      "source_provision": "§4"
    }
  ]
}