{
  "id": "act-70-2023",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2023 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA, kolektívnej zmluvy vyššieho stupňa pre odvetvie drevospracujúceho priemyslu na Slovensku na rok 2023 uzatvorenej medzi Zväzom spracovateľov dreva Slovenskej republiky a Odborovým zväzom DREVO, LESY, VODA, dodatku č. 1 ku kolektívnej zmluve vyššieho stupňa na roky 2022 – 2025 uzatvoreného medzi Odborovým zväzom KOVO a Zväzom sklárskeho priemyslu Slovenskej republiky a dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa na roky 2020 – 2022 uzatvoreného medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2023 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA, kolektívnej zmluvy vyššieho stupňa pre odvetvie drevospracujúceho priemyslu na Slovensku na rok 2023 uzatvorenej medzi Zväzom spracovateľov dreva Slovenskej republiky a Odborovým zväzom DREVO, LESY, VODA, dodatku č. 1 ku kolektívnej zmluve vyššieho stupňa na roky 2022 – 2025 uzatvoreného medzi Odborovým zväzom KOVO a Zväzom sklárskeho priemyslu Slovenskej republiky a dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa na roky 2020 – 2022 uzatvoreného medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "short_name": "70/2023 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2023/70/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2023 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA, kolektívnej zmluvy vyššieho stupňa pre odvetvie drevospracujúceho priemyslu na Slovensku na rok 2023 uzatvorenej medzi Zväzom spracovateľov dreva Slovenskej republiky a Odborovým zväzom DREVO, LESY, VODA, dodatku č. 1 ku kolektívnej zmluve vyššieho stupňa na roky 2022 – 2025 uzatvoreného medzi Odborovým zväzom KOVO a Zväzom sklárskeho priemyslu Slovenskej republiky a dodatku č. 3 ku Kolektívnej zmluve vyššieho stupňa na roky 2020 – 2022 uzatvoreného medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "provisions": [],
  "definitions": []
}