{
  "id": "act-49-2017",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským združením výrobcov piva a sladu, medzi Asociáciou vodárenských spoločností a Odborovým zväzom DREVO, LESY, VODA, medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským cukrovarníckym spolkom, a dodatku č. 1 ku kolektívnym zmluvám vyššieho stupňa medzi Odborovým zväzom KOVO a Nezávislými kresťanskými odbormi Slovenska a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a dodatku č. 8 medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Lekárskym odborovým združením a Asociáciou štátnych nemocníc Slovenskej republiky",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským združením výrobcov piva a sladu, medzi Asociáciou vodárenských spoločností a Odborovým zväzom DREVO, LESY, VODA, medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským cukrovarníckym spolkom, a dodatku č. 1 ku kolektívnym zmluvám vyššieho stupňa medzi Odborovým zväzom KOVO a Nezávislými kresťanskými odbormi Slovenska a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a dodatku č. 8 medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Lekárskym odborovým združením a Asociáciou štátnych nemocníc Slovenskej republiky",
  "short_name": "49/2017 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2017/49/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským združením výrobcov piva a sladu, medzi Asociáciou vodárenských spoločností a Odborovým zväzom DREVO, LESY, VODA, medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska, medzi Odborovým zväzom potravinárov Slovenskej republiky a Slovenským cukrovarníckym spolkom, a dodatku č. 1 ku kolektívnym zmluvám vyššieho stupňa medzi Odborovým zväzom KOVO a Nezávislými kresťanskými odbormi Slovenska a Zväzom hutníctva, ťažobného priemyslu a geológie Slovenskej republiky a dodatku č. 8 medzi Slovenským odborovým zväzom zdravotníctva a sociálnych služieb a Lekárskym odborovým združením a Asociáciou štátnych nemocníc Slovenskej republiky",
  "provisions": [],
  "definitions": []
}