{
  "id": "act-272-2016",
  "type": "statute",
  "title": "Zákon č. 272/2016 Z. z. o dôveryhodných službách pre elektronické transakcie na vnútornom trhu a o zmene a doplnení niektorých zákonov (zákon o dôveryhodných službách)",
  "title_en": "Act No. 272/2016 Coll. on Trust Services for Electronic Transactions",
  "short_name": "Trust Services Act",
  "status": "in_force",
  "issued_date": "2016-09-20",
  "in_force_date": "2016-10-18",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2016/272/",
  "description": "Regulates trust services and related supervisory mechanisms for electronic transactions.",
  "provisions": [
    {
      "provision_ref": "§1",
      "section": "1",
      "title": "Predmet zákona",
      "content": "Tento zákon upravuje podmienky poskytovania dôveryhodných služieb, povinnosti poskytovateľov dôveryhodných služieb, pôsobnosť Národného bezpečnostného úradu (ďalej len „úrad“) v oblasti dôveryhodných služieb, pôsobnosť Ministerstva vnútra Slovenskej republiky (ďalej len „ministerstvo vnútra“) v oblasti elektronickej identifikácie, podmienky poskytovania európskej peňaženky digitálnej identity (ďalej len „európska peňaženka“), povinnosti poskytovateľa európskej peňaženky digitálnej identity (ďalej len „poskytovateľ európskej peňaženky“) a sankcie za porušenie povinností podľa osobitného predpisu a tohto zákona."
    },
    {
      "provision_ref": "§2",
      "section": "2",
      "title": "Používanie kvalifikovaného elektronického podpisu a kvalifikovanej elektronickej pečate v styku s orgánmi verejnej moci",
      "content": "(1) Ak sa v styku s orgánmi verejnej moci používa kvalifikovaný elektronický podpis, kvalifikovaný certifikát pre elektronický podpis vydaný kvalifikovaným poskytovateľom dôveryhodných služieb, ktorému úrad udelil kvalifikovaný štatút, môže ako osobitný atribút obsahovať rodné číslo podpisovateľa; ak mu rodné číslo nebolo pridelené, môže obsahovať číslo cestovného dokladu alebo číslo preukazu totožnosti.\n(2) Ak sa v styku s orgánmi verejnej moci používa kvalifikovaná elektronická pečať, kvalifikovaný certifikát pre elektronickú pečať vydaný kvalifikovaným poskytovateľom dôveryhodných služieb, ktorému úrad udelil kvalifikovaný štatút, môže ako osobitný atribút obsahovať identifikačné číslo pôvodcu pečate."
    },
    {
      "provision_ref": "§3",
      "chapter": "Kvalifikovaný poskytovateľ dôveryhodných služieb",
      "section": "3",
      "title": "§3",
      "content": "(1) Poskytovateľ dôveryhodnej služby bez kvalifikovaného štatútu predkladá úradu\na) oznámenie o zámere poskytovať kvalifikovanú dôveryhodnú službu podľa osobitného predpisu prostredníctvom elektronického formulára, ktorý úrad zverejní na svojom webovom sídle,\nb) certifikát príslušnej kvalifikovanej dôveryhodnej služby,\nc) záverečnú správu o výsledkoch auditu kybernetickej bezpečnosti podľa osobitných predpisov\n(2) Kvalifikovaný poskytovateľ dôveryhodných služieb poskytuje ako kvalifikované len tie dôveryhodné služby, na ktoré mu je udelený kvalifikovaný štatút.\n(3) Kvalifikovaný poskytovateľ dôveryhodných služieb, na ktorého dôveryhodnú službu úrad udelil kvalifikovaný štatút, uvádza vo vydanom kvalifikovanom certifikáte minimálne identifikátory certifikačných politík pre kvalifikované dôveryhodné služby vydávania kvalifikovaného certifikátu, ktoré úrad zverejní na svojom webovom sídle; certifikačné politiky obsahujú aj technické podmienky a postupy podpisovateľa a pôvodcu pečate.\n(4) Kvalifikovaný poskytovateľ dôveryhodnej služby plní povinnosti podľa osobitného predpisu a notifikačné povinnosti prostredníctvom elektronického formulára, ktorý úrad zverejní na svojom webovom sídle.\n(5) Kvalifikovaný poskytovateľ dôveryhodnej služby je povinný úradu oznámiť každú zmenu v poskytovaní kvalifikovanej dôveryhodnej služby prostredníctvom elektronického formulára, ktorý úrad zverejní na svojom webovom sídle, a predložiť\na) certifikát príslušnej kvalifikovanej dôveryhodnej služby v elektronickej podobe,\nb) záverečnú správu o výsledkoch auditu kybernetickej bezpečnosti podľa osobitného predpisu v elektronickej podobe."
    },
    {
      "provision_ref": "§4",
      "chapter": "Kvalifikovaný poskytovateľ dôveryhodných služieb",
      "section": "4",
      "title": "§4",
      "content": "(1) Kvalifikovaný poskytovateľ dôveryhodných služieb môže autorizovať inú vlastnú kvalifikovanú dôveryhodnú službu alebo kvalifikovanú dôveryhodnú službu iného kvalifikovaného poskytovateľa dôveryhodných služieb na poskytovanie informácie o štatúte platnosti alebo zrušenia kvalifikovaných certifikátov, ktoré vydal. Informácia o autorizácii podľa prvej vety sa uvedie v dôveryhodnom zozname vedenom úradom. Autorizácia platí, pokým ju autorizujúci kvalifikovaný poskytovateľ dôveryhodnej služby nezruší alebo pokým dôveryhodná služba nestratí kvalifikovaný štatút.\n(2) Kvalifikovaný poskytovateľ dôveryhodných služieb môže pre prípad ukončenia poskytovania svojej kvalifikovanej dôveryhodnej služby uzavrieť zmluvu s iným kvalifikovaným poskytovateľom dôveryhodných služieb o poskytovaní informácie o štatúte platnosti alebo zrušenia vydaných kvalifikovaných certifikátov a prevzatí súvisiacej prevádzkovej dokumentácie. Ak kvalifikovaný poskytovateľ dôveryhodných služieb neuzavrel dohodu podľa prvej vety a nemá právneho nástupcu, poskytovanie informácie o štatúte platnosti alebo zrušenia vydaných kvalifikovaných certifikátov a prevzatie súvisiacej prevádzkovej dokumentácie zabezpečí úrad. V prípadoch podľa druhej vety dôjde k zrušeniu platných prevzatých kvalifikovaných certifikátov kvalifikovaným poskytovateľom dôveryhodnej služby, alebo ak to technicky nie je možné, tak úradom v prevzatej databáze certifikátov. Informácia o postupe podľa tohto odseku sa uvedie v dôveryhodnom zozname vedenom úradom."
    },
    {
      "provision_ref": "§5",
      "chapter": "Kvalifikovaný poskytovateľ dôveryhodných služieb",
      "section": "5",
      "title": "§5",
      "content": "Kvalifikovaný poskytovateľ dôveryhodných služieb najmenej počas desiatich rokov uchováva informácie,\na) ktoré súvisia s vydaním a zrušením kvalifikovaných certifikátov od uplynutia platnosti kvalifikovaného certifikátu alebo zrušenia kvalifikovaného certifikátu spolu s vydaným kvalifikovaným certifikátom a informáciou o štatúte platnosti alebo zrušenia kvalifikovaného certifikátu aktualizovanou po uplynutí platnosti kvalifikovaného certifikátu alebo zrušení kvalifikovaného certifikátu,\nb) na základe ktorých poskytoval kvalifikovanú dôveryhodnú službu; kvalifikovaný poskytovateľ dôveryhodných služieb uchováva tieto informácie od ich vzniku."
    },
    {
      "provision_ref": "§7",
      "chapter": "Kvalifikovaný poskytovateľ dôveryhodných služieb",
      "section": "7",
      "title": "§7",
      "content": "(1) Kvalifikovaný poskytovateľ dôveryhodnej služby, ktorý vydáva kvalifikované certifikáty, pri poskytovaní informácie o štatúte platnosti alebo zrušení kvalifikovaných certifikátov poskytuje aj informáciu obsahujúcu potvrdenie o dátume a čase, do ktorého boli certifikáty evidované ako platné, alebo informáciu o dátume a čase zrušenia kvalifikovaného certifikátu.\n(2) Kvalifikovaný poskytovateľ dôveryhodných služieb, ktorému kvalifikovaný štatút udelil úrad, nesmie dočasne pozastaviť kvalifikovaný certifikát pre elektronický podpis alebo kvalifikovaný certifikát pre elektronickú pečať."
    },
    {
      "provision_ref": "§8",
      "chapter": "Kvalifikovaný poskytovateľ dôveryhodných služieb",
      "section": "8",
      "title": "Mandátny certifikát",
      "content": "(1) Mandátny certifikát je kvalifikovaný certifikát pre elektronický podpis vydaný fyzickej osobe oprávnenej zo zákona alebo na základe zákona konať za inú osobu alebo orgán verejnej moci alebo v ich mene, alebo fyzickej osobe, ktorá vykonáva činnosť podľa osobitného predpisu, alebo vykonáva funkciu podľa osobitného predpisu (ďalej len „mandatár”). Mandátny certifikát obsahuje\na) identifikačné údaje mandatára podľa ; ak ide o mandatára, ktorý je v pracovnoprávnom vzťahu alebo obdobnom pracovnom vzťahu k orgánu verejnej moci alebo osobe, za ktorú alebo v mene ktorej mandatár koná (ďalej len „mandant“) identifikačným údajom je číslo cestovného dokladu alebo číslo identifikačnej karty,\nb) identifikačné údaje\n1. mandanta podľa ,\n2. orgánu verejnej moci alebo osoby, u ktorej mandatár vykonáva činnosť podľa osobitného predpisu alebo vykonáva funkciu podľa osobitného predpisu, podľa a\nc) označenie oprávnenia podľa odseku 2.\n(2) Mandátnym certifikátom preukazuje mandatár oprávnenie\na) konať za mandanta alebo v mene mandanta,\nb) vykonávať činnosť podľa osobitného predpisu, alebo\nc) vykonávať funkciu podľa osobitného predpisu.\n(3) Kvalifikovaný poskytovateľ dôveryhodných služieb, ktorému kvalifikovaný štatút udelil úrad, vydá mandátny certifikát mandatárovi, ktorý preukáže oprávnenie podľa odseku 2 spôsobom uvedeným pre dané oprávnenie v zozname oprávnení vedenom úradom podľa .\n(4) O zrušenie mandátneho certifikátu bezodkladne požiada\na) orgán verejnej moci alebo osoba, u ktorej mandatár vykonával činnosť alebo funkciu podľa odseku 1 po tom, ako mandatárovi zanikne alebo skončí výkon činnosti alebo funkcie podľa odseku 1,\nb) mandant po tom, ako oprávnenie mandatára konať za alebo v mene mandanta zaniklo,\nc) mandatár po tom, ako sa dozvie, že mandant zomrel, bol vyhlásený za mŕtveho alebo zanikol,\nd) mandatár po tom, ako zaniklo jeho oprávnenie konať za alebo v mene mandanta alebo po tom, ako mu zanikol alebo skončil výkon činnosti alebo funkcie podľa odseku 1.\n(5) Mandátny certifikát nesmie obsahovať pseudonym."
    },
    {
      "provision_ref": "§9",
      "section": "9",
      "title": "Zoznam oprávnení",
      "content": "(1) Zoznam oprávnení je informačný systém verejnej správy, správcom ktorého je úrad.\n(2) Zoznam oprávnení pre každé oprávnenie obsahuje\na) označenie oprávnenia mandatára podľa ,\nb) zoznam dokladov, ktorými sa toto oprávnenie preukazuje, a zoznam dokladov, na základe ktorých toto oprávnenie zaniká.\n(3) Označenie oprávnenia mandatára podľa je totožné s názvom, aký pre dané oprávnenie ustanovujú osobitné predpisy, a ak to nie je možné, musí byť totožné s názvom, ktorý pre dané oprávnenie určuje platný interný predpis alebo písomné poverenie orgánu verejnej moci alebo inej osoby, za ktorú alebo v mene ktorej sa oprávnenie vykonáva.\n(4) Doklady podľa odseku 2 písm. b) sú totožné s dokladmi, na základe ktorých vzniká a zaniká podľa osobitných predpisov dané oprávnenie. Ak oprávnenie vyplýva zo zápisu v zákonom ustanovenej evidencii, dokladom je vždy výpis z tejto evidencie vydaný orgánom verejnej moci, ktorý ju vedie.\n(5) Úrad zapíše údaje podľa odseku 2 do zoznamu oprávnení a aktualizuje ich. Na účely plnenia povinností úradu podľa prvej vety sú štátne orgány a orgány územnej samosprávy povinné bezodkladne oznamovať úradu existujúce oprávnenia podľa , ktoré upravujú všeobecne záväzné právne predpisy v oblasti, v ktorej vykonávajú štátnu správu alebo samosprávu, ako aj každú ich zmenu.\n(6) Úrad zverejňuje zoznam oprávnení v strojovo spracovateľnej podobe na svojom webovom sídle."
    },
    {
      "provision_ref": "§10",
      "section": "10",
      "title": "Európska peňaženka a spoliehajúca sa strana",
      "content": "(1) Poskytovateľ európskej peňaženky je osoba, ktorá je kvalifikovaným poskytovateľom dôveryhodnej služby, alebo na tento účel preukáže, že má s kvalifikovaným poskytovateľom dôveryhodnej služby uzatvorenú zmluvu a spĺňa požiadavky ustanovené osobitným predpisom.\n(2) Poskytovateľ európskej peňaženky predkladá úradu\na) oznámenie o zámere poskytovať európsku peňaženku prostredníctvom elektronického formulára, ktorý úrad zverejní na svojom webovom sídle,\nb) certifikát európskej peňaženky podľa osobitného predpisu v elektronickej podobe.\n(3) Úrad overuje, či poskytovateľ európskej peňaženky spĺňa požiadavky ustanovené týmto zákonom a osobitným predpisom. Ak úrad zistí, že poskytovateľ európskej peňaženky nespĺňa požiadavky ustanovené týmto zákonom a osobitným predpisom, preruší konanie a vyzve ho, aby v určenej lehote odstránil zistené nedostatky.\n(4) Poskytovateľ európskej peňaženky je povinný zrušiť platnosť vydanej európskej peňaženky v prípadoch podľa osobitného predpisu.\n(5) Poskytovateľ európskej peňaženky vykoná registráciu spoliehajúcej sa strany na žiadosť a po overení identity spoliehajúcej sa strany a po získaní jej súhlasu s dodržiavaním pravidiel európskej peňaženky.\n(6) Poskytovateľ európskej peňaženky je povinný\na) poskytnúť na základe žiadosti úradu informácie potrebné na monitorovanie súladu činnosti poskytovateľa európskej peňaženky s osobitným predpisom,\nb) prijať opatrenia na nápravu nesúladu uložené rozhodnutím úradu, ktorým úrad konštatoval nesúlad činnosti poskytovateľa európskej peňaženky s požiadavkami podľa osobitného predpisu,\nc) pozastaviť alebo zrušiť registráciu spoliehajúcej sa strany na základe rozhodnutia úradu,\nd) nahlásiť bezodkladne ministerstvu vnútra automatizovaným spôsobom v procese registrácie spoliehajúcu sa stranu, ktorá používa európsku peňaženku, ktorej vydá certifikáty a prostriedky na vzájomnú autentifikáciu s európskou peňaženkou,\ne) nahlásiť bezodkladne úradu podozrenie z nezákonného alebo podvodného používania európskej peňaženky,\nf) umožniť bezodkladne aktualizovať spoliehajúcej sa strane certifikáty a prostriedky na vzájomnú autentifikáciu s európskou peňaženkou."
    },
    {
      "provision_ref": "§10a",
      "section": "10a",
      "title": "Postavenie a úlohy ministerstva vnútra",
      "content": "(1) Ministerstvo vnútra v oblasti elektronickej identifikácie\na) zostavuje a vedie zoznam spoliehajúcich sa strán, ktoré používajú európsku peňaženku,\nb) je orgánom verejnej moci, ktorý plní povinnosť poskytovať európsku peňaženku podľa osobitného predpisu,\nc) zabezpečuje spojenie osobných identifikačných údajov s európskou peňaženkou v rozsahu podľa osobitného predpisu,\nd) zabezpečuje a poskytuje prostriedky používané pri mechanizme umožňujúcom validáciu osobných identifikačných údajov a totožnosti spoliehajúcich sa strán.\n(2) Ministerstvo vnútra v oblasti elektronického osvedčenia atribútov na základe žiadosti osoby zodpovednej za autentický zdroj\na) identifikuje subjekt verejného sektora, ktorý je zodpovedný za autentický zdroj,\nb) registruje typ atribútov pre elektronické osvedčenia atribútov autentického zdroja pre subjekt verejného sektora identifikovaný podľa písmena a),\nc) vydáva a ruší elektronické osvedčenie atribútov založené na údajoch z autentického zdroja subjektu verejného sektora identifikovaného podľa písmena a); týmto nie je dotknuté oprávnenie vydať alebo zrušiť elektronické osvedčenia atribútov inej osobe."
    },
    {
      "provision_ref": "§11",
      "section": "11",
      "title": "Postavenie a úlohy úradu",
      "content": "Úrad\na) je orgánom dohľadu podľa osobitného predpisu,\nb) je jednotným kontaktným miestom pre dôveryhodné služby, európske peňaženky a schému elektronickej identifikácie,\nc) je členom skupiny pre spoluprácu v oblasti digitálnej identity,\nd) certifikuje spôsobom podľa osobitného predpisu,\ne) plní oznamovacie povinnosti voči Európskej komisii podľa osobitného predpisu,\nf) vydáva, zverejňuje a ruší certifikát na overenie údajov z dôveryhodnej infraštruktúry podľa písmena g),\ng) zriaďuje, udržiava a aktualizuje dôveryhodnú infraštruktúru, poskytuje informácie z dôveryhodnej infraštruktúry, najmä informácie po uplynutí platnosti kvalifikovaného certifikátu, a to vo forme pozitívneho potvrdenia o štatúte platnosti alebo zrušenia kvalifikovaného certifikátu,\nh) zabezpečuje úlohy spojené s uchovávaním dokumentov podľa tohto zákona v dôveryhodnej infraštruktúre, ak kvalifikovaný poskytovateľ dôveryhodnej služby zanikne bez právneho nástupcu,\ni) vytvára, vedie a zverejňuje dôveryhodné zoznamy podľa osobitných predpisov,\nj) poskytuje Európskej komisii informácie a správy podľa osobitného predpisu,\nk) vydáva metodiky a štandardy podľa tohto zákona a zverejňuje ich na svojom webovom sídle,\nl) vydáva, spravuje a zverejňuje certifikačné politiky slúžiace na identifikáciu súladu certifikátov vydaných kvalifikovaným poskytovateľom dôveryhodnej služby s požiadavkami podľa tohto zákona,\nm) vydáva, spravuje a zverejňuje strojovo spracovateľné zoznamy, ktoré obsahujú najmä zoznam algoritmov a ich minimálne parametre pre elektronický podpis od úrovne bezpečnosti zdokonalený elektronický podpis a pre elektronickú pečať od úrovne bezpečnosti zdokonalená elektronická pečať, ktoré sa podľa štandardov pre informačné technológie vo verejnej správe dodržiavajú v styku s orgánmi verejnej moci,\nn) plní informačnú povinnosť podľa osobitného predpisu,\no) pozastavuje poskytovanie európskej peňaženky podľa osobitného predpisu alebo používanie európskej peňaženky podľa osobitného predpisu a ruší platnosť európskej peňaženky podľa osobitného predpisu."
    },
    {
      "provision_ref": "§12",
      "section": "12",
      "title": "Kontrola a dohľad",
      "content": "(1) Úrad je oprávnený vykonávať kontrolu plnenia povinností poskytovateľa dôveryhodnej služby alebo poskytovateľa európskej peňaženky podľa osobitných predpisov.\n(2) Pri výkone dohľadu nad dôveryhodnými službami úrad postupuje podľa osobitného predpisu.\n(3) Pri výkone dohľadu nad rámcom európskej peňaženky úrad postupuje podľa osobitného predpisu."
    },
    {
      "provision_ref": "§13",
      "chapter": "Priestupky a správne delikty",
      "section": "13",
      "title": "§13",
      "content": "(1) Priestupku sa dopustí ten, kto použije značku dôvery EÚ v rozpore s čl. 23 ods. 1 nariadenia Európskeho parlamentu a Rady (EÚ) č. 910/2014 o elektronickej identifikácii a dôveryhodných službách pre elektronické transakcie na vnútornom trhu a o zrušení smernice 1999/93/ES (ďalej len „nariadenie (EÚ) č. 910/2014 v platnom znení“).\n(2) Priestupku sa dopustí ten, kto poruší podmienky a obmedzenia využívania kvalifikovanej dôveryhodnej služby podľa čl. 24 ods. 2 písm. d) nariadenia (EÚ) č. 910/2014 v platnom znení.\n(3) Za priestupky podľa odsekov 1 a 2 možno uložiť pokutu do 2 000 eur.\n(4) Na priestupky a ich prejednávanie sa vzťahuje všeobecný predpis o priestupkoch.\n(5) Priestupky podľa odsekov 1 a 2 prejednáva úrad."
    },
    {
      "provision_ref": "§14",
      "chapter": "Priestupky a správne delikty",
      "section": "14",
      "title": "§14",
      "content": "(1) Úrad uloží pokutu do 3 000 eur právnickej osobe alebo fyzickej osobe podnikateľovi, ktorý sa dopustí správneho deliktu tým, že použije značku dôvery EÚ v rozpore s čl. 23 ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(2) Úrad uloží pokutu do 3 000 eur právnickej osobe alebo fyzickej osobe podnikateľovi, ktorý sa dopustí správneho deliktu tým, že poruší podmienky a obmedzenia využívania kvalifikovanej dôveryhodnej služby podľa čl. 24 ods. 2 písm. d) nariadenia (EÚ) č. 910/2014 v platnom znení.\n(3) Úrad uloží pokutu do 3 000 eur orgánu verejnej moci, ktorý sa dopustí správneho deliktu tým, že odmietne prijať kvalifikovaný elektronický podpis alebo kvalifikovanú elektronickú pečať vo formáte, ktorý je v súlade s prílohou vykonávacieho aktu Komisie vydaného podľa čl. 27 ods. 5 a čl. 37 ods. 5 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(4) Úrad uloží pokutu do 3 000 eur orgánu verejnej moci, ktorý sa dopustí správneho deliktu tým, že vytvorí kvalifikovaný elektronický podpis alebo kvalifikovanú elektronickú pečať vo formáte, ktorý nie je v súlade s prílohou vykonávacieho aktu Komisie vydaného podľa čl. 27 ods. 5 a čl. 37 ods. 5 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(5) Úrad uloží pokutu do 3 000 eur orgánu verejnej moci, ktorý sa dopustí správneho deliktu tým, že vydá elektronické osvedčenie atribútov v rozpore s čl. 45f ods. 2 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(6) Nekvalifikovaný poskytovateľ dôveryhodnej služby sa dopustí správneho deliktu tým, že\na) nemá vhodné politiky na riadenie právnych, obchodných, prevádzkových a iných priamych alebo nepriamych rizík poskytovania nekvalifikovaných dôveryhodných služieb podľa čl. 19a nariadenia (EÚ) č. 910/2014 v platnom znení,\nb) neprijme zodpovedajúce opatrenia na riadenie právnych, obchodných, prevádzkových a iných priamych alebo nepriamych rizík poskytovania nekvalifikovaných dôveryhodných služieb podľa čl. 19a nariadenia (EÚ) č. 910/2014 v platnom znení,\nc) neoznámi podľa čl. 19a nariadenia (EÚ) č. 910/2014 v platnom znení narušenie bezpečnosti, narušenie poskytovania služieb alebo vykonávania opatrení alebo\nd) poskytne osobné údaje v rozpore s čl. 45h ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(7) Úrad uloží nekvalifikovanému poskytovateľovi dôveryhodnej služby za správny delikt podľa odseku 6, ak ide o\na) fyzickú osobu podnikateľa pokutu do 5 000 000 eur,\nb) právnickú osobu pokutu do 5 000 000 eur alebo do 1 % jeho celosvetového ročného obratu za predchádzajúci účtovný rok, v ktorom k správnemu deliktu došlo, podľa toho, ktorá suma je vyššia.\n(8) Kvalifikovaný poskytovateľ dôveryhodnej služby sa dopustí správneho deliktu tým, že\na) poruší povinnosť podľa , alebo čl. 24 ods. 2 písm. a) nariadenia (EÚ) č. 910/2014 v platnom znení,\nb) nepodrobí sa auditu zo strany orgánu posudzovania zhody aspoň raz za 24 mesiacov v rozpore s čl. 20 ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení,\nc) nepredloží úradu výslednú správu o posúdení zhody v lehote troch pracovných dní odo dňa jej doručenia v rozpore s čl. 20 ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení,\nd) neinformuje úrad o plánovanom audite podľa čl. 20 ods. 1a nariadenia (EÚ) č. 910/2014 v platnom znení,\ne) neumožní úradu účasť na audite podľa čl. 20 ods. 1a nariadenia (EÚ) č. 910/2014 v platnom znení,\nf) nepodrobí sa auditu zo strany orgánu posudzovania zhody v rozpore s čl. 20 ods. 2 nariadenia (EÚ) č. 910/2014 v platnom znení,\ng) nezaručí, aby sa na jeho webovom sídle uvádzal odkaz na príslušný dôveryhodný zoznam podľa čl. 23 ods. 2 nariadenia (EÚ) č. 910/2014 v platnom znení,\nh) neoverí totožnosť fyzickej osoby alebo identifikačné údaje právnickej osoby, ktorej vydáva kvalifikovaný certifikát, podľa čl. 24 ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení,\ni) neinformuje orgán dohľadu o všetkých zmenách pri poskytovaní svojich kvalifikovaných dôveryhodných služieb a o zámere ukončiť tieto činnosti podľa čl. 24 ods. 2 písm. a) nariadenia (EÚ) č. 910/2014 v platnom znení,\nj) zamestnáva personál a má subdodávateľov v rozpore s čl. 24 ods. 2 písm. b) nariadenia (EÚ) č. 910/2014 v platnom znení,\nk) neudržiava postačujúce finančné prostriedky podľa čl. 24 ods. 2 písm. c) nariadenia (EÚ) č. 910/2014 v platnom znení,\nl) neuzatvorí vhodné poistenie zodpovednosti za škodu podľa čl. 24 ods. 2 písm. c) nariadenia (EÚ) č. 910/2014 v platnom znení,\nm) neplní informačnú povinnosť podľa čl. 24 ods. 2 písm. d) nariadenia (EÚ) č. 910/2014 v platnom znení,\nn) nepoužíva dôveryhodné systémy a produkty podľa čl. 24 ods. 2 písm. e) nariadenia (EÚ) č. 910/2014 v platnom znení,\no) nepoužíva dôveryhodné systémy na uchovávanie údajov podľa čl. 24 ods. 2 písm. f) nariadenia (EÚ) č. 910/2014 v platnom znení,\np) nemá vhodné politiky alebo neprijíma zodpovedajúce opatrenia na riadenie právnych obchodných, prevádzkových a iným priamych alebo nepriamych rizík podľa čl. 24 ods. 2 písm. fa) nariadenia (EÚ) č. 910/2014 v platnom znení,\nq) neoznámi narušenie bezpečnosti, narušenie poskytovania služieb alebo vykonávania opatrení v rozpore s čl. 24 ods. 2 písm. fb) nariadenia (EÚ) č. 910/2014 v platnom znení,\nr) neprijme vhodné opatrenia proti falšovaniu a krádeži údajov podľa čl. 24 ods. 2 písm. g) nariadenia (EÚ) č. 910/2014 v platnom znení,\ns) nezaznamená, neuchová alebo nesprístupní všetky relevantné informácie podľa čl. 24 ods. 2 písm. h) nariadenia (EÚ) č. 910/2014 v platnom znení,\nt) nemá aktualizovaný plán ukončenia činností na zabezpečenie kontinuity služby podľa čl. 24 ods. 2 písm. i) nariadenia (EÚ) č. 910/2014 v platnom znení,\nu) nezriadi alebo neaktualizuje databázu certifikátov v rozpore s čl. 24 ods. 2 písm. k) nariadenia (EÚ) č. 910/2014 v platnom znení,\nv) nezverejní zrušenie ním vydaného kvalifikovaného certifikátu podľa čl. 24 ods. 3 nariadenia (EÚ) č. 910/2014 v platnom znení,\nw) neposkytne spoliehajúcej sa strane informácie o štatúte platnosti alebo zrušenia ním vydaných kvalifikovaných certifikátov podľa čl. 24 ods. 4 nariadenia (EÚ) č. 910/2014 v platnom znení,\nx) zmení štatút zrušeného kvalifikovaného certifikátu pre elektronický podpis v rozpore s čl. 28 ods. 4 nariadenia (EÚ) č. 910/2014 v platnom znení,\ny) vykonáva službu správy zariadení na vyhotovenie kvalifikovaného elektronického podpisu na diaľku v rozpore s čl. 29a ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení,\nz) neposkytne validáciu kvalifikovaného elektronického podpisu alebo kvalifikovanej elektronickej pečate podľa čl. 33 ods. 1 písm. a) a čl. 40 nariadenia (EÚ) č. 910/2014 v platnom znení,\naa) neumožní spoliehajúcim sa stranám získať výsledok procesu validácie podľa čl. 33 ods. 1 písm. b) a čl. 40 nariadenia (EÚ) č. 910/2014 v platnom znení,\nab) nepoužíva postupy a technológie požadované podľa čl. 34 ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení,\nac) zmení štatút zrušeného kvalifikovaného certifikátu pre elektronickú pečať v rozpore s čl. 38 ods. 4 nariadenia (EÚ) č. 910/2014 v platnom znení,\nad) nezabezpečí, aby ním vydaná kvalifikovaná elektronická časová pečiatka\nae) nezabezpečí, aby ním vydaný kvalifikovaný certifikát obsahoval presné, pravdivé a úplné údaje,\naf) poskytuje elektronické osvedčenie atribútov v rozpore s čl. 45d ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení alebo\nag) poskytne osobné údaje v rozpore s čl. 45h ods. 1 nariadenia (EÚ) č. 910/2014 v platnom znení.\n(9) Úrad uloží kvalifikovanému poskytovateľovi dôveryhodnej služby za správny delikt podľa odseku 8, ak ide o\na) fyzickú osobu podnikateľa pokutu do 5 000 000 eur,\nb) právnickú osobu pokutu do 5 000 000 eur alebo do 1 % jeho celosvetového ročného obratu za predchádzajúci účtovný rok, v ktorom k správnemu deliktu došlo, podľa toho, ktorá suma je vyššia.\n(10) Poskytovateľ európskej peňaženky sa dopustí správneho deliktu tým, že\na) nezruší platnosť európskej peňaženky podľa ,\nb) zaregistruje spoliehajúcu sa stranu v rozpore s alebo\nc) nesplní povinnosť podľa\n(11) Úrad uloží poskytovateľovi európskej peňaženky za správny delikt podľa odseku 10 pokutu do 500 000 eur.\n(12) Pri ukladaní pokuty za správny delikt úrad prihliadne najmä na závažnosť, spôsob, trvanie a dôsledky porušenia povinnosti.\n(13) Ak do jedného roka odo dňa nadobudnutia právoplatnosti rozhodnutia o uložení pokuty dôjde k opätovnému porušeniu povinností, za ktoré bola pokuta uložená podľa odsekov 1 až 5, 7, 9 a 11, úrad uloží pokutu až do dvojnásobku výšky súm uvedených v odsekoch 1 až 5, 7, 9 a 11.\n(14) Pokutu za správny delikt možno uložiť do dvoch rokov odo dňa zistenia porušenia povinnosti, najneskôr však do štyroch rokov odo dňa keď k porušeniu povinnosti došlo.\n(15) Pokuta za správny delikt je splatná do 30 dní odo dňa nadobudnutia právoplatnosti rozhodnutia o jej uložení.\n(16) Pokuty za správne delikty sú príjmom štátneho rozpočtu."
    },
    {
      "provision_ref": "§16",
      "section": "16",
      "title": "Splnomocňovacie ustanovenie",
      "content": "Úrad sa splnomocňuje na vydanie všeobecne záväzného právneho predpisu,\na) ktorý ustanovuje podrobnosti o overovaní kvalifikovaného elektronického podpisu alebo kvalifikovanej elektronickej pečate, formátoch kvalifikovaného elektronického podpisu alebo kvalifikovanej elektronickej pečate, formátoch kvalifikovaných certifikátov, formátoch pre informácie o štatúte platnosti alebo zrušenia kvalifikovaného certifikátu, rozšíreniach dôveryhodného zoznamu, postupoch uchovávania elektronických podpisov, pečatí alebo certifikátov a formátoch podpisových politík pre národné rozšírenia pre dôveryhodnú infraštruktúru a dôveryhodné služby,\nb) ktorým sa ustanovia opatrenia v oblasti elektronickej identifikácie a dôveryhodných služieb podľa osobitného predpisu."
    },
    {
      "provision_ref": "§17",
      "section": "17",
      "title": "Spoločné ustanovenia",
      "content": "(1) Na konanie podľa tohto zákona sa vzťahuje všeobecný predpis o správnom konaní, ak tento zákon neustanovuje inak.\n(2) Ak sa vo všeobecne záväzných právnych predpisoch používa pojem\na) zaručený elektronický podpis, rozumie sa tým kvalifikovaný elektronický podpis,\nb) zaručená elektronická pečať, rozumie sa tým kvalifikovaná elektronická pečať,\nc) časová pečiatka, rozumie sa tým kvalifikovaná elektronická časová pečiatka.\n(3) Ak sa vyžaduje použitie mandátneho certifikátu, rozumie sa tým aj elektronické osvedčenie atribútov, ktoré obsahuje aspoň\na) hash certifikátu kvalifikovaného elektronického podpisu mandatára,\nb) identifikačné údaje mandanta, len ak ide o oprávnenie podľa ,\nc) označenie oprávnenia podľa ,\nd) identitu vydavateľa elektronického osvedčenia atribútov obsahujúcu aj identifikačné údaje osoby, ktorá oprávnenie určuje interným predpisom alebo písomným poverením, ako orgán verejnej moci alebo iná osoba, za ktorú alebo v mene ktorej sa oprávnenie vykonáva."
    },
    {
      "provision_ref": "§18",
      "section": "18",
      "title": "Prechodné ustanovenia",
      "content": "(1) Poskytovateľ akreditovaných certifikačných služieb podľa doterajších predpisov sa, v rozsahu pôvodnej akreditácie podľa doterajších predpisov, považuje za kvalifikovaného poskytovateľa dôveryhodných služieb, ktorému udelil úrad kvalifikovaný štatút, poskytujúceho kvalifikovanú dôveryhodnú službu. Poskytovateľ podľa prvej vety je povinný predložiť úradu správu o posúdení zhody najneskôr do 1. júla 2017; ak správu nepredloží, jeho postavenie poskytovateľa dôveryhodných služieb s kvalifikovaným štatútom poskytujúcim kvalifikovanú dôveryhodnú službu zaniká 2. júla 2017.\n(2) Akreditovaná služba vydávania časových pečiatok, akreditovaná úradom a vedená v zozname dôveryhodných informácií o poskytovateľoch certifikačných služieb podľa osobitného predpisu, sa považuje za dôveryhodnú službu vyhotovovania kvalifikovaných elektronických časových pečiatok s kvalifikovaným štatútom. Poskytovateľ služby podľa prvej vety je povinný predložiť úradu správu o posúdení zhody najneskôr do 1. júla 2017; ak správu nepredloží, jeho postavenie poskytovateľa dôveryhodných služieb s kvalifikovaným štatútom vo vzťahu k tejto službe zaniká 2. júla 2017.\n(3) Bezpečné zariadenie na vyhotovovanie elektronickej pečate podľa doterajších predpisov sa považuje za zariadenie na vyhotovovanie kvalifikovanej elektronickej pečate podľa osobitného predpisu, do uplynutia platnosti alebo zrušenia certifikátu zariadenia.\n(4) Kvalifikovaný systémový certifikát vydaný podľa doterajších predpisov sa považuje za kvalifikovaný certifikát pre kvalifikovanú elektronickú pečať podľa osobitného predpisu, do uplynutia jeho platnosti alebo jeho zrušenia.\n(5) Informácie o štatúte platnosti alebo zrušenia kvalifikovaných certifikátov v Online Certificate Status Protocol (OCSP) odpovedi ktorá musí obsahovať pozitívne prehlásenie o existencii a správnosti údajov sa povinne poskytujú od 1. januára 2018."
    },
    {
      "provision_ref": "§18a",
      "section": "18a",
      "title": "Prechodné ustanovenie k úpravám účinným od 1. augusta 2019",
      "content": "V súvislosti s výkonom činností podľa § 11 ods. 2 v znení účinnom do 31. júla 2019, úrad prevedie súvisiacu prevádzkovú dokumentáciu, vrátane používaných osobných údajov, na nadobúdateľa písomnou dohodou."
    },
    {
      "provision_ref": "§19",
      "section": "19",
      "title": "Zrušovacie ustanovenie",
      "content": "Zrušujú sa:\n1. zákon č. o elektronickom podpise a o zmene a doplnení niektorých zákonov v znení zákona č. 679/2004 Z. z., zákona č. 25/2006 Z. z., zákona č. 275/2006 Z. z., zákona č. 214/2008 Z. z., zákona č. 289/2012 Z. z., zákona č. 305/2013 Z. z., zákona č. 273/2015 Z. z a zákona č. 91/2016 Z. z.,\n2. vyhláška Národného bezpečnostného úradu č. o formáte, obsahu a správe certifikátov a kvalifikovaných certifikátov a formáte, periodicite a spôsobe vydávania zoznamu zrušených kvalifikovaných certifikátov (o certifikátoch a kvalifikovaných certifikátoch) v znení vyhlášky č. 323/2012 Z. z. a vyhlášky č. 60/2014 Z. z.,\n3. vyhláška Národného bezpečnostného úradu č. o podmienkach na poskytovanie akreditovaných certifikačných služieb a o požiadavkách na audit, rozsah auditu a kvalifikáciu audítorov v znení vyhlášky č. 61/2014 Z. z.,\n4. vyhláška Národného bezpečnostného úradu č. o obsahu a rozsahu prevádzkovej dokumentácie vedenej certifikačnou autoritou a o bezpečnostných pravidlách a pravidlách na výkon certifikačných činností v znení vyhlášky č. 62/2014 Z. z.,\n5. vyhláška Národného bezpečnostného úradu č. ktorou sa ustanovujú podrobnosti o požiadavkách na bezpečné zariadenia na vyhotovovanie časovej pečiatky a požiadavky na produkty pre elektronický podpis (o produktoch elektronického podpisu) v znení vyhlášky č. 63/2014 Z. z.,\n6. vyhláška Národného bezpečnostného úradu č. o formáte a spôsobe vyhotovenia zaručeného elektronického podpisu, spôsobe zverejňovania verejného kľúča úradu, podmienkach platnosti pre zaručený elektronický podpis, postupe pri overovaní a podmienkach overovania zaručeného elektronického podpisu, formáte časovej pečiatky a spôsobe jej vyhotovenia, požiadavkách na zdroj časových údajov a požiadavkách na vedenie dokumentácie časových pečiatok (o vyhotovení a overovaní elektronického podpisu a časovej pečiatky) v znení vyhlášky č. 32/2010 Z. z. a vyhlášky č. 64/2014 Z. z.,\n7. vyhláška Národného bezpečnostného úradu č. o spôsobe a postupe používania elektronického podpisu v obchodnom styku a administratívnom styku v znení vyhlášky č. 248/2015 Z. z.\nZákon Národnej rady Slovenskej republiky č. o správnych poplatkoch v znení zákona Národnej rady Slovenskej republiky č. 123/1996 Z. z., zákona Národnej rady Slovenskej republiky č. 224/1996 Z. z., zákona č. 70/1997 Z. z., zákona č. 1/1998 Z. z., zákona č. 232/1999 Z. z., zákona č. 3/2000 Z. z., zákona č. 142/2000 Z. z., zákona č. 211/2000 Z. z., zákona č. 468/2000 Z. z., zákona č. 553/2001 Z. z., zákona č. 96/2002 Z. z., zákona č. 118/2002 Z. z., zákona č. 215/2002 Z. z., zákona č. 237/2002 Z. z., zákona č. 418/2002 Z. z., zákona č. 457/2002 Z. z., zákona č. 465/2002 Z. z., zákona č. 477/2002 Z. z., zákona č. 480/2002 Z. z., zákona č. 190/2003 Z. z., zákona č. 217/2003 Z. z., zákona č. 245/2003 Z. z., zákona č. 450/2003 Z. z., zákona č. 469/2003 Z. z., zákona č. 583/2003 Z. z., zákona č. 5/2004 Z. z., zákona č. 199/2004 Z. z., zákona č. 204/2004 Z. z., zákona č. 347/2004 Z. z., zákona č. 382/2004 Z. z., zákona č. 434/2004 Z. z., zákona č. 533/2004 Z. z., zákona č. 541/2004 Z. z., zákona č. 572/2004 Z. z., zákona č. 578/2004 Z. z., zákona č. 581/2004 Z. z., zákona č. 633/2004 Z. z., zákona č. 653/2004 Z. z., zákona č. 656/2004 Z. z., zákona č. 725/2004 Z. z., zákona č. 5/2005 Z. z., zákona č. 8/2005 Z. z., zákona č. 15/2005 Z. z., zákona č. 93/2005 Z. z., zákona č. 171/2005 Z. z., zákona č. 308/2005 Z. z., zákona č. 331/2005 Z. z., zákona č. 341/2005 Z. z., zákona č. 342/2005 Z. z., zákona č. 468/2005 Z. z, zákona č. 473/2005 Z. z., zákona č. 491/2005 Z. z., zákona č. 538/2005 Z. z., zákona č. 558/2005 Z. z., zákona č. 572/2005 Z. z., zákona č. 573/2005 Z. z., zákona č. 610/2005 Z. z., zákona č. 14/2006 Z. z., zákona č. 15/2006 Z. z., zákona č. 24/2006 Z. z., zákona č. 117/2006 Z. z., zákona č. 124/2006 Z. z., zákona č. 126/2006 Z. z., zákona č. 224/2006 Z. z., zákona č. 342/2006 Z. z., zákona č. 672/2006 Z. z., zákona č. 693/2006 Z. z., zákona č. 21/2007 Z. z., zákona č. 43/2007 Z. z., zákona č. 95/2007 Z. z., zákona č. 193/2007 Z. z., zákona č. 220/2007 Z. z., zákona č. 279/2007 Z. z., zákona č. 295/2007 Z. z., zákona č. 309/2007 Z. z., zákona č. 342/2007 Z. z., zákona č. 343/2007 Z. z., zákona č. 344/2007 Z. z., zákona č. 355/2007 Z. z., zákona č. 358/2007 Z. z., zákona č. 359/2007 Z. z., zákona č. 460/2007 Z. z., zákona č. 517/2007 Z. z., zákona č. 537/2007 Z. z., zákona č. 548/2007 Z. z., zákona č. 571/2007 Z. z., zákona č. 577/2007 Z. z., zákona č. 647/2007 Z. z., zákona č. 661/2007 Z. z., zákona č. 92/2008 Z. z., zákona č. 112/2008 Z. z., zákona č. 167/2008 Z. z., zákona č. 214/2008 Z. z., zákona č. 264/2008 Z. z., zákona č. 405/2008 Z. z., zákona č. 408/2008 Z. z., zákona č. 451/2008 Z. z., zákona č. 465/2008 Z. z., zákona č. 495/2008 Z. z., zákona č. 514/2008 Z. z., zákona č. 8/2009 Z. z., zákona č. 45/2009 Z. z., zákona č. 188/2009 Z. z., zákona č. 191/2009 Z. z., zákona č. 274/2009 Z. z., zákona č. 292/2009 Z. z., zákona č. 304/2009 Z. z., zákona č. 305/2009 Z. z., zákona č. 307/2009 Z. z., zákona č. 465/2009 Z. z., zákona č. 478/2009 Z. z., zákona č. 513/2009 Z. z., zákona č. 568/2009 Z. z., zákona č. 570/2009 Z. z., zákona č. 594/2009 Z. z., zákona č. 67/2010 Z. z., zákona č. 92/2010 Z. z., zákona č. 136/2010 Z. z., zákona č. 144/2010 Z. z., zákona č. 514/2010 Z. z., zákona č. 556/2010 Z. z., zákona č. 39/2011 Z. z., zákona č. 119/2011 Z. z., zákona č. 200/2011 Z. z., zákona č. 223/2011 Z. z., zákona č. 254/2011 Z. z., zákona č. 256/2011 Z. z., zákona č. 258/2011 Z. z., zákona č. 324/2011 Z. z., zákona č. 342/2011 Z. z., zákona č. 363/2011 Z. z., zákona č. 381/2011 Z. z., zákona č. 392/2011 Z. z., zákona č. 404/2011 Z. z., zákona č. 405/2011 Z. z., zákona č. 409/2011 Z. z., zákona č. 519/2011 Z. z., zákona č. 547/2011 Z. z., zákona č. 49/2012 Z. z., zákona č. 96/2012 Z. z., zákona č. 251/2012 Z. z., zákona č. 286/2012 Z. z., zákona č. 336/2012 Z. z., zákona č. 339/2012 Z. z., zákona č. 351/2012 Z. z., zákona č. 439/2012 Z. z., zákona č. 447/2012 Z. z., zákona č. 459/2012 Z. z., zákona č. 8/2013 Z. z., zákona č. 39/2013 Z. z., zákona č. 40/2013 Z. z., zákona č. 72/2013 Z. z., zákona č. 75/2013 Z. z., zákona č. 94/2013 Z. z., zákona č. 96/2013 Z. z., zákona č. 122/2013 Z. z., zákona č. 144/2013 Z. z., zákona č. 154/2013 Z. z., zákona č. 213/2013 Z. z., zákona č. 311/2013 Z. z., zákona č. 319/2013 Z. z., zákona č.347/2013 Z. z., zákona č. 387/2013 Z. z., zákona č. 388/2013 Z. z., zákona č. 474/2013 Z. z., zákona č. 506/2013 Z. z., zákona č. 35/2014 Z. z., zákona č. 58/2014 Z. z., zákona č. 84/2014 Z. z., zákona č. 152/2014 Z. z., zákona č. 162/2014 Z. z., zákona č. 182/2014 Z. z., zákona č. 204/2014 Z. z., zákona č. 262/2014 Z. z., zákona č. 293/2014 Z. z., zákona č. 335/2014 Z. z., zákona č. 399/2014 Z. z., zákona č. 40/2015 Z. z. zákona č. 79/2015 Z. z., zákona č. 120/2015 Z. z., zákona č. 128/2015 Z. z., zákona č. 129/2015 Z. z., zákona č. 247/2015 Z. z., zákona č. 253/2015 Z. z., zákona č. 259/2015 Z. z., zákona č. 262/2015 Z. z., zákona č. 273/2015 Z. z., zákona č. 387/2015 Z. z., zákona č. 403/2015 Z. z a zákona č. 125/2016 Z. z. sa mení takto:\n1. V Prehľade sadzobníka správnych poplatkov v časti XX. sa slová „Elektronický podpis“ nahrádzajú slovami „Dôveryhodné služby“.\n2. V Sadzobníku správnych poplatkov XX. časť vrátane nadpisu znie:\nPoložka 268\na) Udelenie kvalifikovaného štatútu 665 eur b) Certifikácia 332 eur“. “.\nZákon č. o organizácii činnosti vlády a organizácii ústrednej štátnej správy v znení zákona č. 143/2002 Z. z., zákona č. 411/2002 Z. z., zákona č. 465/2002 Z. z., zákona č. 139/2003 Z. z., zákona č. 453/2003 Z. z., zákona č. 523/2003 Z. z., zákona č. 215/2004 Z. z., zákona č. 351/2004 Z. z., zákona č. 405/2004 Z. z., zákona č. 585/2004 Z. z., zákona č. 654/2004 Z. z., zákona č. 78/2005 Z. z., zákona č. 172/2005 Z. z., zákona č. 474/2005 Z. z., zákona č. 231/2006 Z. z., zákona č. 678/2006 Z. z., zákona č. 103/2007 Z. z., zákona č. 218/2007 Z. z., zákona č. 456/2007 Z. z., zákona č. 568/2007 Z. z., zákona č. 617/2007 Z. z., zákona č. 165/2008 Z. z., zákona č. 408/2008 Z. z., zákona č. 583/2008 Z. z., zákona č. 70/2009 Z. z., zákona č. 165/2009 Z. z., zákona č. 400/2009 Z. z., zákona č. 403/2009 Z. z., zákona č. 505/2009 Z. z., zákona č. 557/2009 Z. z., zákona č. 570/2009 Z. z., zákona č. 37/2010 Z. z., zákona č. 372/2010 Z. z., zákona č. 403/2010 Z. z., zákona č. 547/2010 Z. z., zákona č. 392/2011 Z. z., zákona č. 287/2012 Z. z., zákona č. 60/2013 Z. z., zákona č. 311/2013 Z. z, zákona č. 313/2013 Z. z., zákona č. 335/2014 Z. z., zákona č. 172/2015 Z. z., zákona č. 339/2015 Z. z., zákona č. 358/2015 Z. z., zákona č. 392/2015 Z. z. a zákona č. 171/2016 Z. z. sa mení takto:\nV § 34 sa slová „elektronický podpis“ nahrádzajú slovami „dôveryhodné služby“.\nZákon č. o občianskych preukazoch a o zmene a doplnení niektorých zákonov v znení zákona č. 693/2006 Z. z., zákona č. 647/2007 Z. z., zákona č. 445/2008 Z. z., zákona č. 49/2012 Z. z., zákona č. 336/2012 Z. z. a zákona č. 125/2015 Z. z. sa mení a dopĺňa takto:\n1. V § 4b odsek 2 znie:\n„(2) Bezpečnostný osobný kód je kombináciou najmenej šiestich a najviac desiatich číslic. Občan, ktorý v čase podania žiadosti o vydanie občianskeho preukazu nedovŕšil 65. rok veku, si bezpečnostný osobný kód zvolí pri podaní žiadosti; ostatní občania si môžu bezpečnostný osobný kód zvoliť pri podaní žiadosti alebo neskôr na okresnom riaditeľstve. Za občana pozbaveného spôsobilosti na právne úkony zvolí bezpečnostný osobný kód jeho opatrovník.“.\n2. V § 6 ods. 1 sa slová „okresné riaditeľstvo v územnom obvode, v ktorom má občan trvalý pobyt“ nahrádzajú slovami „ktorékoľvek okresné riaditeľstvo“.\n3. V § 17a vypúšťa odsek 6.\n4. Za § 17a sa vkladá § 17b, ktorý vrátane nadpisu znie:"
    },
    {
      "provision_ref": "„§ 17b",
      "chapter": "„XX. ČASŤ DÔVERYHODNÉ SLUŽBY",
      "section": "„§ 17b",
      "title": "Prechodné ustanovenia k úpravám účinným dňom vyhlásenia",
      "content": "(1) Občanovi, ktorý požiadal o vydanie občianskeho preukazu podľa doterajších predpisov, okresné riaditeľstvo vydá občiansky preukaz podľa ustanovení tohto zákona účinných ku dňu podania žiadosti o vydanie občianskeho preukazu.\n(2) Občan, ktorému bol vydaný občiansky preukaz s elektronickým čipom podľa doterajších predpisov a nemá zvolený bezpečnostný osobný kód, si môže zvoliť bezpečnostný osobný kód na okresnom riaditeľstve.\n(3) Pri podaní žiadosti o vydanie občianskeho preukazu prostredníctvom portálu ministerstva (§ 7b) sa postupuje podľa § 4b ods. 2 najneskôr od 1. júla 2017.“.\nZákon č. o elektronickej podobe výkonu pôsobnosti orgánov verejnej moci a o zmene a doplnení niektorých zákonov (zákon o e-Governmente) v znení zákona č. 214/2014 Z. z., zákona č. 29/2015 Z. z., zákona č. 130/2015 Z. z. a zákona č. 273/2015 Z. z. sa mení a dopĺňa takto:\n1. Za § 22a sa vkladá § 22aa, ktorý vrátane nadpisu znie:"
    },
    {
      "provision_ref": "„§ 22aa",
      "chapter": "„XX. ČASŤ DÔVERYHODNÉ SLUŽBY",
      "section": "„§ 22aa",
      "title": "Autentifikačný certifikát",
      "content": "(1) Autentifikačný certifikát je elektronický dokument, ktorý preukazuje elektronickú identitu toho, komu bol vydaný, a používa sa na účely identifikácie a autentifikácie pri prístupe k informačnému systému alebo elektronickej komunikácii, ktoré súvisia s výkonom verejnej moci, alebo na účely prístupu do elektronickej schránky alebo disponovanie s elektronickou schránkou.\n(2) Autentifikačný certifikát obsahuje údaje o tom, že ide o autentifikačný certifikát a identifikátor toho, komu bol vydaný.“.\n2. V § 13 ods. 4, § 19 ods. 4 písm. b), § 22a ods. 1 a 2, § 22b ods. 2 až 6 a § 60a ods. 7 a 8 sa vypúšťa odkaz 12b vrátane poznámky pod čiarou k odkazu 12b.\n3. V § 31 ods. 3 sa slová „vykonanie jeho zaručenej konverzie (§ 35 ods. 2) podľa tohto zákona a doručuje výstup z tejto konverzie v listinnej podobe; doručenie výstupu zo zaručenej konverzie“ nahrádzajú slovami „vyhotovenie rovnopisu elektronického dokumentu v listinnej podobe a doručuje tento rovnopis; doručenie rovnopisu“.\n4. V § 35 ods. 3 písm. a) sa za slová „orgán verejnej moci“ vkladá čiarka a dopĺňa sa slovo „advokát“ a v písm. c) sa vypúšťajú slová „advokát alebo“.\n5. V § 37 ods. 1 písm. h) sa vypúšťa bodkočiarka a slová „ak bola zaručená konverzia vykonaná automatizovaným spôsobom, tieto údaje sa neuvádzajú“.\n6. V § 59 sa odsek 3 dopĺňa písmenom h), ktoré znie:\n„h) podrobnosti o spôsobe vydávania autentifikačných certifikátov podľa § 22aa.“.\n7. V § 60 ods. 12 sa slová „tri roky odo dňa účinnosti tohto zákona“ nahrádzajú slovami „do 31. januára 2018“ a slová „troch rokov odo dňa účinnosti tohto zákona“ nahrádzajú slovami „doby podľa prvej vety“.\n8. V § 60a ods. 5 sa slová „odseku 1“ nahrádzajú slovami „odseku 4“.\n9. Za § 60a sa vkladajú § 60b až 60d, ktoré vrátane nadpisu nad § 60b znejú:"
    },
    {
      "provision_ref": "§60b",
      "chapter": "„Prechodné ustanovenia k úpravám účinným dňom vyhlásenia",
      "section": "60b",
      "title": "§60b",
      "content": "(1) Orgán verejnej moci, ktorý prevádzkuje špecializovaný portál, nie je do 31. januára 2018 povinný prepojiť informačné systémy verejnej správy) v jeho správe s ústredným portálom, ak umožňuje elektronickú komunikáciu s nimi prostredníctvom ústredného portálu iným spôsobom.\n(2) Orgán verejnej moci je od 1. novembra 2016 do 31. januára 2018 oprávnený pri výkone verejnej moci elektronicky postupovať aj podľa osobitných predpisov, ak ustanovujú odlišnú úpravu postupu orgánu verejnej moci pri výkone verejnej moci elektronicky a odlišné náležitosti elektronickej podoby návrhu na začatie konania, žaloby, žiadosti, sťažnosti, vyjadrenia, stanoviska, ohlásenia alebo iného obdobného dokumentu, ktoré sa v konaní predkladajú orgánu verejnej moci, alebo odlišné náležitosti elektronickej podoby rozhodnutia, žiadosti, vyjadrenia, stanoviska alebo iného dokumentu, ktoré v konaní vydáva orgán verejnej moci, ako tento zákon.\n(3) Ak ide o právnické osoby, ktoré nemajú aktivovanú elektronickú schránku a nie sú zapísané v obchodnom registri, správca modulu elektronických schránok aktivuje ich elektronickú schránku 1. mája 2018; to platí, aj ak pri právnickej osobe, ktorá nie je zapísaná v obchodnom registri, dôjde k splneniu podmienky na aktiváciu elektronickej schránky odo dňa účinnosti tohto zákona do 30. apríla 2018. Na právnické osoby podľa prvej vety sa do 30. apríla 2018 ustanovenia § 60a ods. 5 nepoužijú. Ak právnická osoba podľa prvej vety požiada o skoršiu aktiváciu elektronickej schránky, správca modulu elektronických schránok žiadosti vyhovie a ustanovenia § 13 ods. 3 sa použijú primerane. Informáciu o tom, akých právnických osôb sa postup podľa prvej až tretej vety týka, zverejňuje a aktualizuje správca modulu elektronických schránok na ústrednom portáli."
    },
    {
      "provision_ref": "§60d",
      "chapter": "„Prechodné ustanovenia k úpravám účinným dňom vyhlásenia",
      "section": "60d",
      "title": "Prechodné ustanovenie k úpravám účinným od 1. marca 2017",
      "content": "Úrad podpredsedu vlády Slovenskej republiky pre investície a informatizáciu (ďalej len „úrad podpredsedu vlády“) zriadi centrálnu evidenciu záznamov o vykonanej zaručenej konverzii a začne prideľovať evidenčné číslo záznamu o vykonanej zaručenej konverzii podľa § 39 ods. 6 najneskôr 1. januára 2018; o zriadení evidencie a prideľovaní evidenčného čísla informuje úrad podpredsedu vlády na svojom webovom sídle a na ústrednom portáli. Do dňa nasledujúceho po dni zriadenia centrálnej evidencie záznamov o vykonanej zaručenej konverzii nie je osoba vykonávajúca konverziu povinná postupovať podľa § 36 ods. 5 a Notárska komora Slovenskej republiky nie je povinná postupovať podľa § 39 ods. 6.“.\nPoznámka pod čiarou k odkazu 33 znie:\n„) Čl. 3 ods. 30 nariadenia Európskeho parlamentu a Rady (EÚ) č. 910/2014 o elektronickej identifikácii a dôveryhodných službách pre elektronické transakcie na vnútornom trhu a o zrušení smernice 1999/93/ES (Ú. v. EÚ L 257, 28. 8. 2014).“.\n10. Slová „zoznam referenčných registrov“ vo všetkých tvaroch sa v celom texte zákona nahrádzajú slovami „zoznam referenčných údajov“ v príslušnom tvare.\n11. Slová „autentifikačný kvalifikovaný certifikát“ vo všetkých tvaroch sa v celom texte zákona nahrádzajú slovami „autentifikačný certifikát podľa § 22aa“ v príslušnom tvare a slová „register autentifikačných kvalifikovaných certifikátov“ vo všetkých tvaroch sa v celom texte zákona nahrádzajú slovami „register autentifikačných certifikátov“ v príslušnom tvare.\n(1) Tento zákon nadobúda účinnosť dňom vyhlásenia okrem , ktorý nadobúda účinnosť 1. marca 2017.\n(2) Ustanovenie § 60c uvedené v čl. V deviatom bode stráca účinnosť 31. decembra 2017."
    }
  ],
  "definitions": []
}