{
  "id": "act-424-2025",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2026 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA a o uložení dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Integrovaným odborovým zväzom a Úniou zamestnávateľov v civilnom letectve Slovenskej republiky",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2026 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA a o uložení dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Integrovaným odborovým zväzom a Úniou zamestnávateľov v civilnom letectve Slovenskej republiky",
  "short_name": "424/2025 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2025/424/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Organizáciou zamestnávateľov skupiny COOP Jednota a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení kolektívnej zmluvy vyššieho stupňa pre odvetvie lesného hospodárstva Slovenskej republiky na rok 2026 uzatvorenej medzi Združením zamestnávateľov lesného hospodárstva na Slovensku a Odborovým zväzom DREVO, LESY, VODA a o uložení dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Integrovaným odborovým zväzom a Úniou zamestnávateľov v civilnom letectve Slovenskej republiky",
  "provisions": [],
  "definitions": []
}