{
  "id": "act-32-2025",
  "type": "statute",
  "title": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, pre príslušníkov Policajného zboru, pre príslušníkov Horskej záchrannej služby, pre odvetvie lesného hospodárstva Slovenskej republiky, o uložení Kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Zväzom obchodu Slovenskej republiky a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení Dodatku č. 11 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb a o uložení Dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "title_en": "Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, pre príslušníkov Policajného zboru, pre príslušníkov Horskej záchrannej služby, pre odvetvie lesného hospodárstva Slovenskej republiky, o uložení Kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Zväzom obchodu Slovenskej republiky a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení Dodatku č. 11 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb a o uložení Dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "short_name": "32/2025 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2025/32/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva práce, sociálnych vecí a rodiny Slovenskej republiky o uložení kolektívnych zmlúv vyššieho stupňa pre príslušníkov Hasičského a záchranného zboru, pre príslušníkov Policajného zboru, pre príslušníkov Horskej záchrannej služby, pre odvetvie lesného hospodárstva Slovenskej republiky, o uložení Kolektívnej zmluvy vyššieho stupňa uzatvorenej medzi Zväzom obchodu Slovenskej republiky a Odborovým zväzom pracovníkov obchodu a cestovného ruchu, o uložení Dodatku č. 11 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Asociáciou priemyslu, poľnohospodárstva a služieb a Odborovým zväzom výroby, obchodu a služieb a o uložení Dodatku č. 5 ku Kolektívnej zmluve vyššieho stupňa uzatvorenej medzi Energeticko-chemickým odborovým zväzom a Zväzom zamestnávateľov energetiky Slovenska",
  "provisions": [],
  "definitions": []
}