{
  "id": "act-147-2020",
  "type": "statute",
  "title": "Uznesenie vlády Slovenskej republiky k návrhu na skončenie núdzového stavu, zrušenie uloženia pracovnej povinnosti na zabezpečenie výkonu zdravotnej starostlivosti, zrušenie zákazu uplatňovania práva na štrajk niektorým pracovníkom a zrušenie zákazu uplatňovania práva pokojne sa zhromažďovať vyhláseného uznesením vlády Slovenskej republiky č. 114 z 15. marca 2020 a rozšíreného uznesením vlády Slovenskej republiky č. 115 z 18. marca 2020, uznesením vlády Slovenskej republiky č. 169 z 27. marca 2020, uznesením vlády Slovenskej republiky č. 207 zo 6. apríla 2020 a uznesením vlády Slovenskej republiky č. 233 zo 16. apríla 2020",
  "title_en": "Uznesenie vlády Slovenskej republiky k návrhu na skončenie núdzového stavu, zrušenie uloženia pracovnej povinnosti na zabezpečenie výkonu zdravotnej starostlivosti, zrušenie zákazu uplatňovania práva na štrajk niektorým pracovníkom a zrušenie zákazu uplatňovania práva pokojne sa zhromažďovať vyhláseného uznesením vlády Slovenskej republiky č. 114 z 15. marca 2020 a rozšíreného uznesením vlády Slovenskej republiky č. 115 z 18. marca 2020, uznesením vlády Slovenskej republiky č. 169 z 27. marca 2020, uznesením vlády Slovenskej republiky č. 207 zo 6. apríla 2020 a uznesením vlády Slovenskej republiky č. 233 zo 16. apríla 2020",
  "short_name": "147/2020 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2020/147/",
  "description": "Official legal act listed in Slov-Lex: Uznesenie vlády Slovenskej republiky k návrhu na skončenie núdzového stavu, zrušenie uloženia pracovnej povinnosti na zabezpečenie výkonu zdravotnej starostlivosti, zrušenie zákazu uplatňovania práva na štrajk niektorým pracovníkom a zrušenie zákazu uplatňovania práva pokojne sa zhromažďovať vyhláseného uznesením vlády Slovenskej republiky č. 114 z 15. marca 2020 a rozšíreného uznesením vlády Slovenskej republiky č. 115 z 18. marca 2020, uznesením vlády Slovenskej republiky č. 169 z 27. marca 2020, uznesením vlády Slovenskej republiky č. 207 zo 6. apríla 2020 a uznesením vlády Slovenskej republiky č. 233 zo 16. apríla 2020",
  "provisions": [],
  "definitions": []
}