{
  "id": "act-36-2006",
  "type": "statute",
  "title": "Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o prijatí Dohody medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní a Dodatkového protokolu k Dohode medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní",
  "title_en": "Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o prijatí Dohody medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní a Dodatkového protokolu k Dohode medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní",
  "short_name": "36/2006 Z. z.",
  "status": "unknown",
  "url": "https://www.slov-lex.sk/ezbierky/pravne-predpisy/SK/ZZ/2006/36/",
  "description": "Official legal act listed in Slov-Lex: Oznámenie Ministerstva zahraničných vecí Slovenskej republiky o prijatí Dohody medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní a Dodatkového protokolu k Dohode medzi Belgickým kráľovstvom, Dánskym kráľovstvom, Spolkovou republikou Nemecko, Írskou republikou, Talianskou republikou, Luxemburským veľkovojvodstvom, Holandským kráľovstvom, Európskym spoločenstvom pre atómovú energiu a Medzinárodnou agentúrou pre atómovú energiu o implementácii čl. III ods. 1 a 4 Zmluvy o nešírení jadrových zbraní",
  "provisions": [],
  "definitions": []
}